#+title: Prácticas segundo parcial

** Código de apoyo
#+begin_src python :session *py* :results output :exports both :tangled /tmp/test.py
  import crypt
  import os
  import base64

  password = 'patito'

  bytes_aleatorios = os.urandom(16)
  print(bytes_aleatorios)

  salt = base64.b64encode(bytes_aleatorios).decode('utf-8')
  print(salt)

  hasheado = crypt.crypt(password, '$6$' + salt) # esto es lo que se guarda
  print(hasheado)

  # loguear usuario 
  partes = hasheado.split('$')
  complemento = '$' + partes[1] + '$' + partes[2] # parte[1] el el algoritmo, parte[2] es el salt
  print(complemento)
  print(hasheado == crypt.crypt('patito', complemento))

#+end_src

#+RESULTS:
: b'\x91\xceg\xd6<k\xa8 0\xb6\xe9D]\xd4\xa4&'
: kc5n1jxrqCAwtulEXdSkJg==
: $6$kc5n1jxrqCAwtulE$yPpKD3GzJPuJGcUGkChOj/bTMc8QbJzYPCfZUCUSmv.yOcH5Y6153EKVqnVSVyYEN2TZ3IYQE8QmNvb3p/CE70
: $6$kc5n1jxrqCAwtulE
: True

